; domain
(define (domain pacman-72)
  (:requirements :strips :typing)
  (:types position)

  (:predicates
    (at ?pos - position)
    (not_at ?pos - position)          ; complement of at
    (visited ?pos - position)
    (connected ?from ?to - position)
    (hasFood ?pos - position)
    (noFood ?pos - position)          ; complement of hasFood
    (carryingFood) 
  )

  (:action move
    :parameters (?from ?to - position)
    :precondition (and
      (at ?from)
      (not_at ?to)
      (connected ?from ?to)
    )
    :effect (and
      (at ?to)
      (not (at ?from))        ; DELETE: Pacman is no longer at ?from
      (not_at ?from)
      (visited ?to)
      (not (not_at ?to))      ; DELETE: ?to is no longer marked as not_at
    )
  )

  (:action eat
    :parameters (?pos - position)
    :precondition (and
      (at ?pos)
      (hasFood ?pos)
    )
    :effect (and
      (carryingFood)
      (noFood ?pos)
      (not (hasFood ?pos))   ; DELETE: the food is gone
    )
  )
)

; problem
(define (problem pacman-72)
    (:domain pacman-72)
    (:objects
        p00 p01 p02 p03 p04 p05 p06 p10 p11 p12 p13 p14 p15 p16 p20 p21 p22 p23 p24 p25 p26 p30 p31 p32 p33 p34 p35 p36 p40 p41 p42 p43 p44 p45 p46 p50 p51 p52 p53 p54 p55 p56 p60 p61 p62 p63 p64 p65 p66 - position
    )

    (:init
        (not_at p00)
        (not (at p00))
        (not_at p01)
        (not (at p01))
        (not_at p02)
        (not (at p02))
        (not_at p03)
        (not (at p03))
        (not_at p04)
        (not (at p04))
        (not_at p05)
        (not (at p05))
        (not_at p06)
        (not (at p06))
        (not_at p10)
        (not (at p10))
        (not_at p11)
        (not (at p11))
        (not_at p12)
        (not (at p12))
        (not_at p13)
        (not (at p13))
        (not_at p14)
        (not (at p14))
        (not_at p15)
        (not (at p15))
        (not_at p16)
        (not (at p16))
        (not_at p20)
        (not (at p20))
        (not_at p21)
        (not (at p21))
        (not_at p22)
        (not (at p22))
        (not_at p23)
        (not (at p23))
        (not_at p24)
        (not (at p24))
        (not_at p25)
        (not (at p25))
        (not_at p26)
        (not (at p26))
        (not_at p30)
        (not (at p30))
        (not_at p31)
        (not (at p31))
        (not_at p32)
        (not (at p32))
        (not_at p33)
        (not (at p33))
        (not_at p34)
        (not (at p34))
        (not_at p35)
        (not (at p35))
        (not_at p36)
        (not (at p36))
        (not_at p40)
        (not (at p40))
        (not_at p41)
        (not (at p41))
        (not_at p42)
        (not (at p42))
        (not_at p43)
        (not (at p43))
        (not_at p44)
        (not (at p44))
        (not_at p45)
        (not (at p45))
        (not_at p46)
        (not (at p46))
        (not_at p50)
        (not (at p50))
        (not_at p51)
        (not (at p51))
        (not_at p52)
        (not (at p52))
        (not_at p53)
        (not (at p53))
        (not_at p54)
        (not (at p54))
        (not_at p55)
        (not (at p55))
        (not_at p56)
        (not (at p56))
        (not_at p60)
        (not (at p60))
        (not_at p61)
        (not (at p61))
        (at p62)
        (not (not_at p62))
        (not_at p63)
        (not (at p63))
        (not_at p64)
        (not (at p64))
        (not_at p65)
        (not (at p65))
        (not_at p66)
        (not (at p66))
        (noFood p00)
        (not (hasFood p00))
        (noFood p01)
        (not (hasFood p01))
        (noFood p02)
        (not (hasFood p02))
        (noFood p03)
        (not (hasFood p03))
        (noFood p04)
        (not (hasFood p04))
        (hasFood p05)
        (not (noFood p05))
        (noFood p06)
        (not (hasFood p06))
        (noFood p10)
        (not (hasFood p10))
        (noFood p11)
        (not (hasFood p11))
        (noFood p12)
        (not (hasFood p12))
        (noFood p13)
        (not (hasFood p13))
        (noFood p14)
        (not (hasFood p14))
        (noFood p15)
        (not (hasFood p15))
        (noFood p16)
        (not (hasFood p16))
        (noFood p20)
        (not (hasFood p20))
        (noFood p21)
        (not (hasFood p21))
        (hasFood p22)
        (not (noFood p22))
        (noFood p23)
        (not (hasFood p23))
        (hasFood p24)
        (not (noFood p24))
        (noFood p25)
        (not (hasFood p25))
        (noFood p26)
        (not (hasFood p26))
        (hasFood p30)
        (not (noFood p30))
        (noFood p31)
        (not (hasFood p31))
        (noFood p32)
        (not (hasFood p32))
        (noFood p33)
        (not (hasFood p33))
        (noFood p34)
        (not (hasFood p34))
        (hasFood p35)
        (not (noFood p35))
        (noFood p36)
        (not (hasFood p36))
        (noFood p40)
        (not (hasFood p40))
        (hasFood p41)
        (not (noFood p41))
        (noFood p42)
        (not (hasFood p42))
        (noFood p43)
        (not (hasFood p43))
        (noFood p44)
        (not (hasFood p44))
        (noFood p45)
        (not (hasFood p45))
        (noFood p46)
        (not (hasFood p46))
        (noFood p50)
        (not (hasFood p50))
        (noFood p51)
        (not (hasFood p51))
        (noFood p52)
        (not (hasFood p52))
        (noFood p53)
        (not (hasFood p53))
        (noFood p54)
        (not (hasFood p54))
        (noFood p55)
        (not (hasFood p55))
        (noFood p56)
        (not (hasFood p56))
        (noFood p60)
        (not (hasFood p60))
        (noFood p61)
        (not (hasFood p61))
        (noFood p62)
        (not (hasFood p62))
        (noFood p63)
        (not (hasFood p63))
        (noFood p64)
        (not (hasFood p64))
        (noFood p65)
        (not (hasFood p65))
        (noFood p66)
        (not (hasFood p66))
        (connected p00 p10)
        (connected p10 p00)
        (connected p00 p01)
        (connected p01 p00)
        (connected p01 p11)
        (connected p11 p01)
        (connected p01 p02)
        (connected p02 p01)
        (connected p02 p12)
        (connected p12 p02)
        (connected p02 p03)
        (connected p03 p02)
        (connected p03 p13)
        (connected p13 p03)
        (connected p03 p04)
        (connected p04 p03)
        (connected p04 p14)
        (connected p14 p04)
        (connected p04 p05)
        (connected p05 p04)
        (connected p05 p15)
        (connected p15 p05)
        (connected p05 p06)
        (connected p06 p05)
        (connected p06 p16)
        (connected p16 p06)
        (connected p10 p20)
        (connected p20 p10)
        (connected p10 p11)
        (connected p11 p10)
        (connected p11 p21)
        (connected p21 p11)
        (connected p11 p12)
        (connected p12 p11)
        (connected p12 p22)
        (connected p22 p12)
        (connected p12 p13)
        (connected p13 p12)
        (connected p13 p23)
        (connected p23 p13)
        (connected p13 p14)
        (connected p14 p13)
        (connected p14 p24)
        (connected p24 p14)
        (connected p14 p15)
        (connected p15 p14)
        (connected p15 p25)
        (connected p25 p15)
        (connected p15 p16)
        (connected p16 p15)
        (connected p16 p26)
        (connected p26 p16)
        (connected p20 p30)
        (connected p30 p20)
        (connected p20 p21)
        (connected p21 p20)
        (connected p21 p31)
        (connected p31 p21)
        (connected p21 p22)
        (connected p22 p21)
        (connected p22 p32)
        (connected p32 p22)
        (connected p22 p23)
        (connected p23 p22)
        (connected p23 p33)
        (connected p33 p23)
        (connected p23 p24)
        (connected p24 p23)
        (connected p24 p34)
        (connected p34 p24)
        (connected p24 p25)
        (connected p25 p24)
        (connected p25 p35)
        (connected p35 p25)
        (connected p25 p26)
        (connected p26 p25)
        (connected p26 p36)
        (connected p36 p26)
        (connected p30 p40)
        (connected p40 p30)
        (connected p30 p31)
        (connected p31 p30)
        (connected p31 p41)
        (connected p41 p31)
        (connected p31 p32)
        (connected p32 p31)
        (connected p32 p42)
        (connected p42 p32)
        (connected p32 p33)
        (connected p33 p32)
        (connected p33 p43)
        (connected p43 p33)
        (connected p33 p34)
        (connected p34 p33)
        (connected p34 p44)
        (connected p44 p34)
        (connected p34 p35)
        (connected p35 p34)
        (connected p35 p45)
        (connected p45 p35)
        (connected p35 p36)
        (connected p36 p35)
        (connected p36 p46)
        (connected p46 p36)
        (connected p40 p50)
        (connected p50 p40)
        (connected p40 p41)
        (connected p41 p40)
        (connected p41 p51)
        (connected p51 p41)
        (connected p41 p42)
        (connected p42 p41)
        (connected p42 p52)
        (connected p52 p42)
        (connected p42 p43)
        (connected p43 p42)
        (connected p43 p53)
        (connected p53 p43)
        (connected p43 p44)
        (connected p44 p43)
        (connected p44 p54)
        (connected p54 p44)
        (connected p44 p45)
        (connected p45 p44)
        (connected p45 p55)
        (connected p55 p45)
        (connected p45 p46)
        (connected p46 p45)
        (connected p46 p56)
        (connected p56 p46)
        (connected p50 p60)
        (connected p60 p50)
        (connected p50 p51)
        (connected p51 p50)
        (connected p51 p61)
        (connected p61 p51)
        (connected p51 p52)
        (connected p52 p51)
        (connected p52 p62)
        (connected p62 p52)
        (connected p52 p53)
        (connected p53 p52)
        (connected p53 p63)
        (connected p63 p53)
        (connected p53 p54)
        (connected p54 p53)
        (connected p54 p64)
        (connected p64 p54)
        (connected p54 p55)
        (connected p55 p54)
        (connected p55 p65)
        (connected p65 p55)
        (connected p55 p56)
        (connected p56 p55)
        (connected p56 p66)
        (connected p66 p56)
        (connected p60 p61)
        (connected p61 p60)
        (connected p61 p62)
        (connected p62 p61)
        (connected p62 p63)
        (connected p63 p62)
        (connected p63 p64)
        (connected p64 p63)
        (connected p64 p65)
        (connected p65 p64)
        (connected p65 p66)
        (connected p66 p65)
    )

    (:goal (and
        (noFood p24)
        (noFood p30)
        (noFood p22)
        (noFood p41)
        (noFood p05)
        (noFood p35)
    ))
)

; plan
1. (move p62 p52)
   deleted: (at p62) (not_at p52)
   added: (at p52) (not_at p62) (visited p52)
   goals met: 0 of 6
2. (move p52 p42)
   deleted: (at p52) (not_at p42)
   added: (at p42) (not_at p52) (visited p42)
   goals met: 0 of 6
3. (move p42 p41)
   deleted: (at p42) (not_at p41)
   added: (at p41) (not_at p42) (visited p41)
   goals met: 0 of 6
4. (eat p41)
   deleted: (hasfood p41)
   added: (carryingfood) (nofood p41)
   goals met: 1 of 6
5. (move p41 p31)
   deleted: (at p41) (not_at p31)
   added: (at p31) (not_at p41) (visited p31)
   goals met: 1 of 6
6. (move p31 p30)
   deleted: (at p31) (not_at p30)
   added: (at p30) (not_at p31) (visited p30)
   goals met: 1 of 6
7. (eat p30)
   deleted: (hasfood p30)
   added: (nofood p30)
   goals met: 2 of 6
8. (move p30 p31)
   deleted: (at p30) (not_at p31)
   added: (at p31) (not_at p30)
   goals met: 2 of 6
9. (move p31 p32)
   deleted: (at p31) (not_at p32)
   added: (at p32) (not_at p31) (visited p32)
   goals met: 2 of 6
10. (move p32 p22)
   deleted: (at p32) (not_at p22)
   added: (at p22) (not_at p32) (visited p22)
   goals met: 2 of 6
11. (eat p22)
   deleted: (hasfood p22)
   added: (nofood p22)
   goals met: 3 of 6
12. (move p22 p23)
   deleted: (at p22) (not_at p23)
   added: (at p23) (not_at p22) (visited p23)
   goals met: 3 of 6
13. (move p23 p24)
   deleted: (at p23) (not_at p24)
   added: (at p24) (not_at p23) (visited p24)
   goals met: 3 of 6
14. (eat p24)
   deleted: (hasfood p24)
   added: (nofood p24)
   goals met: 4 of 6
15. (move p24 p25)
   deleted: (at p24) (not_at p25)
   added: (at p25) (not_at p24) (visited p25)
   goals met: 4 of 6
16. (move p25 p35)
   deleted: (at p25) (not_at p35)
   added: (at p35) (not_at p25) (visited p35)
   goals met: 4 of 6
17. (eat p35)
   deleted: (hasfood p35)
   added: (nofood p35)
   goals met: 5 of 6
18. (move p35 p25)
   deleted: (at p35) (not_at p25)
   added: (at p25) (not_at p35)
   goals met: 5 of 6
19. (move p25 p15)
   deleted: (at p25) (not_at p15)
   added: (at p15) (not_at p25) (visited p15)
   goals met: 5 of 6
20. (move p15 p05)
   deleted: (at p15) (not_at p05)
   added: (at p05) (not_at p15) (visited p05)
   goals met: 5 of 6
21. (eat p05)
   deleted: (hasfood p05)
   added: (nofood p05)
   goals met: 6 of 6
